# <font face = 'Impact' color = '#FFAEBC' > Exercise on Loading, Organizing, and Storing Data<font/>
#### <font face = 'Times New Roman' color = '#B5E5CF'> Licence: GPL v3.0 <font/>
#### <font face = 'Times New Roman' color = '#B5E5CF'> Author and Trainer: Paolo Hilado MSc. (Data Science) <font/>
Showcase your learning and skills by accomplishing this jupyter notebook. Follow through each of the tasks and code with python to address them.

#### <font face = 'Times New Roman' color = 'Purple' > Submitted by: Maria Consuelo Mangonon<font/>

#### <font face = 'Times New Roman' color = 'Purple'> Your Level and Section: BSIS 4A-BA <font/>

#### <font face = 'Times New Roman' color = 'Purple'> Date: September 5, 2025 <font/>

In [7]:
# Import the necesary libraries such as pandas, researchpy, os, and numpy.
import pandas as pd
import numpy as np
import os

In [8]:
#Checking out the current working directory
print(os.getcwd())

C:\Users\ASUS\Downloads\Business Analytics

In [9]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\asus\anaconda3\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\asus\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [11]:
#Load a spreadsheet and assigning it to a variable df.
# Open and work on "ExperimentOne.xlsx".
import pandas as pd
df = pd.read_excel("ExperimentOne.xlsx")
df

    ID   Post  Group
0    1  17.23  Cntrl
1    2  16.04  Cntrl
2    3  19.22  Cntrl
3    4  19.45  Cntrl
4    5  18.53  Cntrl
..  ..    ...    ...
69  70   6.86     Tx
70  71  17.63     Tx
71  72  18.84     Tx
72  73  15.11     Tx
73  74  19.07     Tx

[74 rows x 3 columns]

In [12]:
#View the dataframe
df

    ID   Post  Group
0    1  17.23  Cntrl
1    2  16.04  Cntrl
2    3  19.22  Cntrl
3    4  19.45  Cntrl
4    5  18.53  Cntrl
..  ..    ...    ...
69  70   6.86     Tx
70  71  17.63     Tx
71  72  18.84     Tx
72  73  15.11     Tx
73  74  19.07     Tx

[74 rows x 3 columns]

In [13]:
# Viewing the first 7 rows
df.head(7)

   ID   Post  Group
0   1  17.23  Cntrl
1   2  16.04  Cntrl
2   3  19.22  Cntrl
3   4  19.45  Cntrl
4   5  18.53  Cntrl
5   6  21.00  Cntrl
6   7  19.28  Cntrl

In [14]:
# Viewing the last 7 rows
df.tail(7)

    ID   Post Group
67  68  12.55    Tx
68  69  19.67    Tx
69  70   6.86    Tx
70  71  17.63    Tx
71  72  18.84    Tx
72  73  15.11    Tx
73  74  19.07    Tx

In [15]:
# Slice the data frame to only show the data on the "Post" Column.
sub = df.iloc[:, 1:2]
sub

     Post
0   17.23
1   16.04
2   19.22
3   19.45
4   18.53
..    ...
69   6.86
70  17.63
71  18.84
72  15.11
73  19.07

[74 rows x 1 columns]

In [16]:
# Create different subsets of the data frame and show it.
# Get the data for the first column

sub1 = df.iloc[:, 0:1]
sub1

    ID
0    1
1    2
2    3
3    4
4    5
..  ..
69  70
70  71
71  72
72  73
73  74

[74 rows x 1 columns]

In [17]:
# Get the Post Test and Group data for records 1-10 
sub3 = df.iloc[0:10, 1:3]
sub3

    Post  Group
0  17.23  Cntrl
1  16.04  Cntrl
2  19.22  Cntrl
3  19.45  Cntrl
4  18.53  Cntrl
5  21.00  Cntrl
6  19.28  Cntrl
7  19.63  Cntrl
8  12.66  Cntrl
9  17.55  Cntrl

In [58]:
# Get the Post Test and Group data for records 7,11,15,50,61.
sub4 = df.iloc[[7,11,15,50,61], 1:3]
sub4

     Post  Group
7   19.63  Cntrl
11  16.55  Cntrl
15  21.04  Cntrl
50  18.58     Tx
61  16.41     Tx

In [18]:
# Check the information of the data frame such as number of records and features,
# data types of each feature and file size.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      74 non-null     int64
 1   Post    74 non-null     float64
 2   Group   74 non-null     object
dtypes: float64(1), int64(1), object(1)
memory usage: 1.9+ KB

In [19]:
#Checking for NAs or missing cases for the data set
df.isnull().values.any()

False

In [20]:
# Check for NAs per column
df.isnull().sum()

ID       0
Post     0
Group    0
dtype: int64

In [62]:
# Provide a descriptive analysis for the Post Test measure
desc1 = df.describe().Post
desc1

count    74.000000
mean     16.924324
std       3.344020
min       5.280000
25%      16.055000
50%      18.205000
75%      19.160000
max      21.040000
Name: Post, dtype: float64

In [63]:
# Provide a descriptive analysis for Post Test measure per Group.
# Make sure that it is rounded to two decimal places only.
# Save this in the variable labeled results.
# Present the results variable
desc2 = df.groupby('Group')['Post'].describe().round(2)
desc2

       count   mean   std   min    25%    50%    75%    max
Group
Cntrl   37.0  17.23  3.52  5.28  16.24  19.05  19.42  21.04
Tx      37.0  16.62  3.17  6.86  16.01  17.63  18.55  20.83

# Journal on Activity: Exercise One

### The problems that I encountered while accomplishing this exercise are the errors in my code. First, when I imported the xlsx file, it got error. I looked up how to solve those error but my clsssmate helped me to fix it. My fault for not looking up the error at the end of the line, which stated "need to install openpyxl. It already fixed. Second, another error on my code was getting a data in a specific column. So I researched the possible code and seek to my seatmate's help and I got manage to correct my code. Lastly, the last code which got error multiple times, just to get right. The 2 decimal places only got me absent-minded but I researched again and I found a solution. I may not code as fast like them but at least, I manage to finish it all.